In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('income.csv', names=["name","income"],skiprows=1)
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [6]:
df.income.describe()

count    7.000000e+00
mean     1.433929e+06
std      3.777283e+06
min      4.000000e+03
25%      5.500000e+03
50%      7.000000e+03
75%      7.750000e+03
max      1.000000e+07
Name: income, dtype: float64

In [7]:
df.income.quantile(0)

np.float64(4000.0)

In [13]:
df.income.quantile(0.25,interpolation="higher")

np.int64(6000)

In [14]:
df.income.quantile(0.5,interpolation="higher")

np.int64(7000)

In [10]:
df.income.quantile(0.75)

np.float64(7750.0)

In [15]:
df.income.quantile(1)

np.float64(10000000.0)

In [16]:
percentile_99 = df.income.quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [17]:
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [19]:
df['income'][3]=np.nan

C:\Users\Yash\AppData\Local\Temp\ipykernel_13388\385840147.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.nan
C:\Users\Yash\AppData\Local\Temp\ipykernel_13388\385840147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

In [20]:
df.income.mean()

np.float64(1671666.6666666667)

In [21]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [22]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0